cask_args appdir: '/Applications'

# Taps
tap "github/gh"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "pivotal/tap"

# CLI Apps
brew "xz"
brew "awscli"
brew "curl"
brew "doctl"
brew "gcc"
brew "gh"
brew "git"
brew "helm"
brew "htop"
brew "httpie"
brew "iperf3"
brew "k3d"
brew "kotlin"
brew "lazygit"
brew "mtr"
brew "neovim"
brew "node"
brew "pandoc"
brew "pipenv"
brew "pyenv"
brew "python"
brew "sshuttle"
brew "tilt"
brew "tree"
brew "wget"
brew "yarn"
brew "zsh"
brew "heroku"

# Cask
cask "amethyst"
cask "dash"	
cask "google-chrome"
cask "iterm2"
cask "little-snitch"
cask "notion"
cask "slack"
cask "telegram"
cask "whatsapp"
cask "balenaetcher"
cask "discord"
cask "google-cloud-sdk"
cask "java"
cask "mactex"		
cask "onedrive"
cask "spectacle"
cask "transmission"
cask "clamxav"
cask "docker"
cask "google-drive"
cask "jetbrains-toolbox"
cask "mendeley"
cask "postman"
cask "spotify"
cask "visual-studio-code"
cask "cyberduck"
cask "figma"
cask "hex-fiend"
cask "keepassxc"
cask "ngrok"
cask "scapple"		
cask "sublime-text"
cask "vlc"
