cask_args appdir: '/Applications'

# Taps
tap "github/gh"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/services"
tap "pivotal/tap"

# CLI Apps
brew "apache-arrow"
brew "cookiecutter"
brew "coreutils"
brew "curl"
brew "gcc"
brew "gh"
brew "git"
brew "helm"
brew "htop"
brew "iperf3"
brew "k3d"
brew "kubectx"
brew "kubernetes-cli"
brew "lazygit"
brew "mtr"
brew "mysql"
brew "nmap"
brew "node"
brew "poetry"
brew "postgresql"
brew "pyenv"
brew "sqlite"
brew "sshuttle"
brew "tree"
brew "uv"
brew "volta"
brew "xz"
brew "zsh"

# Languages
brew "python"

# Shell tooling
brew "fzf"
brew "shellcheck"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# Cask
cask "adobe-creative-cloud"
cask "bitwarden"
cask "bruno"
cask "clamxav"
cask "cyberduck"
cask "discord"
cask "docker"
cask "figma"
cask "google-chrome"
cask "google-cloud-sdk"
cask "google-drive"
cask "iterm2"
cask "itermai"
cask "jetbrains-toolbox"
cask "kdrive"
cask "little-snitch"
cask "mendeley"
cask "microsoft-teams"
cask "miro"
cask "ngrok"
cask "qgis"
cask "superhuman"
cask "spotify"
cask "sublime-text"
cask "telegram"
cask "whatsapp"
cask "zotero"

# Added by dot (2026-06-24)
tap "anomalyco/tap"
tap "broadcom/tap", "https://github.com/Broadcom/homebrew-tap.git"
tap "heroku/brew"
tap "jesseduffield/lazydocker"
brew "aom"
brew "grpc"
brew "bib-tool"
brew "pycparser"
brew "cffi"
brew "cmake"
brew "cryptography"
brew "libssh2"
brew "docutils"
brew "ffmpeg"
brew "jpeg-xl"
brew "webp"
brew "geos"
brew "gnutls"
brew "libassuan"
brew "pinentry"
brew "gnupg"
brew "gpgme"
brew "hdf5"
brew "proj"
brew "libgeotiff"
brew "libheif"
brew "libspatialite"
brew "netcdf"
brew "numpy"
brew "openjpeg"
brew "poppler"
brew "gdal"
brew "git-lfs"
brew "graphviz"
brew "grpc@1.54"
brew "httrack"
brew "keyring"
brew "libass"
brew "libfido2"
brew "libmicrohttpd"
brew "librist"
brew "minio-mc"
brew "openjdk"
brew "pipenv"
brew "postgresql@14"
brew "postgresql@18"
brew "pygit2"
brew "python-build"
brew "tcl-tk"
brew "python-tk@3.12"
brew "python@3.11"
brew "python@3.13"
brew "qemu"
brew "redis"
brew "supabase"
brew "superfile"
brew "tailscale"
brew "tesseract"
brew "unbound"
brew "virtualenv"
brew "wget"
brew "yt-dlp"
brew "anomalyco/tap/opencode", trusted: true
cask "claude-code"
cask "codex"
cask "conductor"
cask "cryptomator"
cask "cursor"
cask "docker-desktop", args: { appdir: "/Applications" }
cask "drawio"
cask "gcloud-cli", args: { appdir: "/Applications" }
cask "microsoft-auto-update"
cask "mountain-duck"
cask "obsidian"
cask "opencode-desktop"
cask "orbstack"
cask "quarto"
cask "signal"
cask "sublime-merge"
cask "tailscale-app"
cask "teamviewer"
cask "visual-studio-code"
cask "zoom"
