cask_args appdir: '/Applications'

# Taps
tap "github/gh"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "pivotal/tap"

# CLI Apps
brew "ack"
brew "apache-arrow"
brew "cookiecutter"
brew "awscli"
brew "coreutils"
brew "curl"
brew "doctl"
brew "dvc"
brew "gcc"
brew "gh"
brew "go"
brew "git"
brew "helm"
brew "htop"
brew "httpie"
brew "iperf3"
brew "k3d"
brew "kubectx"
brew "kubernetes-cli"
brew "kotlin"
brew "lazygit"
brew "mtr"
brew "mysql"
brew "neovim"
brew "nmap"
brew "node"
brew "pipenv"
brew "poetry"
brew "postgresql"
brew "pyenv"
brew "python"
brew "sqlite"
brew "sshuttle"
brew "tilt"
brew "tree"
brew "volta"
brew "xz"
brew "yarn"
brew "zsh"

# Cask
cask "adobe-creative-cloud"
cask "amethyst"
cask "bitwarden"
cask "clamxav"
cask "cyberduck"
cask "discord"
cask "docker"
cask "figma"
cask "google-chrome"
cask "google-cloud-sdk"
cask "google-drive"
cask "iterm2"
cask "java"
cask "jetbrains-toolbox"
cask "little-snitch"
cask "maccy"
cask "mactex"
cask "mendeley"
cask "microsoft-teams"
cask "miro"
cask "ngrok"
cask "notion"
cask "onedrive"
cask "postman"
cask "slack"
cask "superhuman"
cask "spotify"
cask "sublime-merge"
cask "sublime-text"
cask "telegram"
cask "transmission"
cask "vlc"
cask "whatsapp"
